validation_cases/workshop1/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 348.432
    volScalarFieldValue p 1e5
);

regions
(
    boxToCell 
    {
        box (0 -1 -1) (5 1 1);
        fieldValues 
        ( 
            volScalarFieldValue T 278.746
            volScalarFieldValue p 1e4
        );
    }
);


// ************************************************************************* //
